In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
data = pd.read_csv('purchase_data.csv')
data

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10.0,A,2,0.0,3.0,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10.0,A,2,0.0,1.0,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10.0,A,2,0.0,12.0,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10.0,A,2,0.0,12.0,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16.0,C,4+,0.0,8.0,NaN,NaN,7969.0
...,...,...,...,...,...,...,...,...,...,...,...,...
263010,1004473,P00041942,M,36-45,1.0,B,3,0.0,5.0,18.0,NaN,3722.0
263011,1004473,P00115142,M,36-45,1.0,B,3,0.0,1.0,8.0,17.0,19253.0
263012,1004473,P00188442,M,36-45,1.0,B,3,0.0,5.0,7.0,NaN,3608.0
263013,1004473,P00119442,M,36-45,1.0,B,3,0.0,5.0,NaN,NaN,3604.0
263014,10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 263015 entries, 0 to 263014
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     263015 non-null  int64
 1   Product_ID                  263014 non-null  object
 2   Gender                      263014 non-null  object
 3   Age                         263014 non-null  object
 4   Occupation                  263014 non-null  float64
 5   City_Category               263014 non-null  object
 6   Stay_In_Current_City_Years  263014 non-null  object
 7   Marital_Status              263014 non-null  float64
 8   Product_Category_1          263014 non-null  float64
 9   Product_Category_2          181501 non-null  float64
 10  Product_Category_3          80582 non-null   float64
 11  Purchase                    263014 non-null  float64
dtypes: float64(6), int64(1), object(5)
memory usage: 24.1+ MB

In [5]:
data.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,2.630150e+05,263014.000000,263014.000000,263014.000000,181501.000000,80582.000000,263014.000000
mean,1.002941e+06,8.083558,0.408685,5.291099,9.844756,12.658298,9319.305269
std,2.593126e+03,6.524052,0.491592,3.745722,5.086696,4.129156,4970.152966
min,1.000000e+01,0.000000,0.000000,1.000000,2.000000,3.000000,185.000000
25%,1.001457e+06,2.000000,0.000000,1.000000,5.000000,9.000000,5863.000000
50%,1.002972e+06,7.000000,0.000000,5.000000,9.000000,14.000000,8060.000000
75%,1.004335e+06,14.000000,1.000000,8.000000,15.000000,16.000000,12059.000000
max,1.006040e+06,20.000000,1.000000,18.000000,18.000000,18.000000,23961.000000

In [7]:
# Checking unique values in the 'Stay_In_Current_City_Years' column will help us understand why its data type is
# 'Object'. Ideally, it should have been in 'float' or 'Int' type.
data.Stay_In_Current_City_Years.unique()
data['Stay_In_Current_City_Years'].unique()
# As seen below, the 'Nan', '+' entry causes the datatype to be displayed as 'object' type.

array(['2', '4+', '3', '1', '0', nan], dtype=object)

In [8]:
# Changing all the values of 4+ to 4
data['Stay_In_Current_City_Years'] = data['Stay_In_Current_City_Years'].replace('4+', '4')

In [9]:
# Converting entries in the given column from string type to numeric type. You can also use the .astype function
# If there are spaces inside string values, eg ( ) or (@), (''), coerce--> changes it to 'Nan' values.
# Nan values can be removed using the 'isna' function later during data cleaning process.
data['Stay_In_Current_City_Years'] = pd.to_numeric(data['Stay_In_Current_City_Years'], errors = 'coerce')

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 263015 entries, 0 to 263014
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     263015 non-null  int64
 1   Product_ID                  263014 non-null  object
 2   Gender                      263014 non-null  object
 3   Age                         263014 non-null  object
 4   Occupation                  263014 non-null  float64
 5   City_Category               263014 non-null  object
 6   Stay_In_Current_City_Years  263014 non-null  float64
 7   Marital_Status              263014 non-null  float64
 8   Product_Category_1          263014 non-null  float64
 9   Product_Category_2          181501 non-null  float64
 10  Product_Category_3          80582 non-null   float64
 11  Purchase                    263014 non-null  float64
dtypes: float64(7), int64(1), object(4)
memory usage: 24.1+ MB

In [11]:
data.City_Category.unique()

array(['A', 'C', 'B', nan], dtype=object)

In [12]:
data.Age.unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25', nan],
      dtype=object)

In [14]:
data.Age.value_counts()

Age
26-35    104912
36-45     52396
18-25     48193
46-50     21619
51-55     18509
55+       10321
0-17       7064
Name: count, dtype: int64

In [16]:
data.isnull().sum()

User_ID                            0
Product_ID                         1
Gender                             1
Age                                1
Occupation                         1
City_Category                      1
Stay_In_Current_City_Years         1
Marital_Status                     1
Product_Category_1                 1
Product_Category_2             81514
Product_Category_3            182433
Purchase                           1
dtype: int64

In [17]:
data.isnull().sum().sum()
# In Machine Learning, you should have as much data as possible. So, the best option, then would be to retain the data and 
# Fill the null values with 'Mean' or 'Median' if its 'Numerical' type and with Mode, if the data type is 'Object'

263956

In [18]:
# Dropping the null values from the entire data
data.dropna(inplace = True)

In [19]:
data.isnull().sum().sum()

0

In [20]:
data.shape

(80582, 12)

In [22]:
from sklearn.preprocessing import LabelEncoder

In [23]:
le = LabelEncoder()

In [24]:
data['Product_ID'] = le.fit_transform(data['Product_ID'])
data['Gender'] = le.fit_transform(data['Gender'])
data['Age'] = le.fit_transform(data['Age'])
data['City_Category'] = le.fit_transform(data['City_Category'])

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 80582 entries, 1 to 263011
Data columns (total 12 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   User_ID                     80582 non-null  int64
 1   Product_ID                  80582 non-null  int32
 2   Gender                      80582 non-null  int32
 3   Age                         80582 non-null  int32
 4   Occupation                  80582 non-null  float64
 5   City_Category               80582 non-null  int32
 6   Stay_In_Current_City_Years  80582 non-null  float64
 7   Marital_Status              80582 non-null  float64
 8   Product_Category_1          80582 non-null  float64
 9   Product_Category_2          80582 non-null  float64
 10  Product_Category_3          80582 non-null  float64
 11  Purchase                    80582 non-null  float64
dtypes: float64(7), int32(4), int64(1)
memory usage: 6.8 MB

### Performing Statistical Analysis

In [ ]:
# Steps involved in Statistical Analysis
# 1. Collection of Data
# 2. Preparing Samples
# 3. Creating Hypothesis( Null and Alternate)
# 4. Applying Appropriate test
# 5. Results (Whether p_value '<' or '>' alpha)

### Q1. It was observed that the average purchase made by the Men of the age 18-25 was 10000. Is it still the same?

In [27]:
# We have encode 'Gender' of 'Male' as 1 and Age group of 18-25 as '1'. So, filter the data accordingly.
new_data = data[(data['Age']==1) & (data['Gender']==1)]
new_data

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
98,1000022,487,1,1,15.0,0,4.0,0.0,1.0,8.0,17.0,12099.0
103,1000022,402,1,1,15.0,0,4.0,0.0,1.0,11.0,16.0,12098.0
111,1000022,358,1,1,15.0,0,4.0,0.0,2.0,4.0,15.0,9564.0
127,1000025,332,1,1,4.0,2,4.0,0.0,1.0,5.0,9.0,15361.0
128,1000025,71,1,1,4.0,2,4.0,0.0,1.0,2.0,15.0,15770.0
...,...,...,...,...,...,...,...,...,...,...,...,...
262758,1004446,180,1,1,18.0,1,1.0,1.0,1.0,2.0,15.0,11512.0
262759,1004446,394,1,1,18.0,1,1.0,1.0,1.0,15.0,18.0,11521.0
262760,1004446,23,1,1,18.0,1,1.0,1.0,1.0,2.0,13.0,3988.0
262764,1004446,75,1,1,18.0,1,1.0,1.0,5.0,8.0,17.0,5444.0
262952,1004465,209,1,1,4.0,0,1.0,1.0,2.0,3.0,4.0,3240.0

In [29]:
# Preparing sample
Random_sample = new_data.sample(1000, random_state = 5) # random_state fixes the value and prevents it from changing 
Random_sample

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
240694,1001132,31,1,1,12.0,0,1.0,1.0,1.0,2.0,15.0,4082.0
123394,1001086,326,1,1,4.0,0,2.0,0.0,1.0,2.0,9.0,15478.0
17981,1002837,56,1,1,0.0,1,1.0,0.0,5.0,6.0,9.0,3522.0
177200,1003439,316,1,1,17.0,2,3.0,0.0,3.0,4.0,5.0,10893.0
25073,1003850,88,1,1,3.0,1,0.0,0.0,2.0,8.0,18.0,9535.0
...,...,...,...,...,...,...,...,...,...,...,...,...
159745,1000718,59,1,1,2.0,2,2.0,0.0,1.0,2.0,5.0,19085.0
182743,1004194,434,1,1,4.0,2,1.0,1.0,2.0,5.0,15.0,13027.0
22333,1003508,459,1,1,4.0,2,0.0,1.0,1.0,15.0,16.0,19453.0
155962,1000068,146,1,1,4.0,0,0.0,0.0,1.0,2.0,5.0,19084.0
47046,1001237,226,1,1,4.0,2,1.0,1.0,6.0,11.0,13.0,16619.0

In [30]:
population_mean = 10000

In [33]:
Random_sample['Purchase'].mean()

11686.459

In [35]:
from scipy.stats import ttest_1samp

In [37]:
t_statistic, p_value = ttest_1samp(Random_sample['Purchase'],population_mean) # Comparing mean of 2 groups 'sample' and 'popul'
print(t_statistic, p_value)

10.652344649997922 3.593214362507284e-25

In [ ]:
# Since p_value < alpha, we reject the null hypothesis ans accept the alternate hypothesis.

### Q2. It was observed that the percentage of women who spend more than 10000 was 35%. Is it still the same?

In [38]:
new_data1 = data.loc[(data['Purchase']>10000)]
new_data1

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
1,1000001,391,0,0,10.0,0,2.0,0.0,1.0,6.0,14.0,15200.0
6,1000004,284,1,4,7.0,1,2.0,1.0,1.0,8.0,17.0,19215.0
13,1000005,211,1,2,20.0,0,1.0,1.0,1.0,2.0,5.0,15665.0
16,1000006,517,0,5,9.0,0,1.0,0.0,2.0,3.0,4.0,13055.0
18,1000007,58,1,3,1.0,1,1.0,1.0,1.0,14.0,16.0,11788.0
...,...,...,...,...,...,...,...,...,...,...,...,...
262995,1004472,175,0,4,16.0,1,0.0,1.0,1.0,11.0,15.0,11661.0
262997,1004472,402,0,4,16.0,1,0.0,1.0,1.0,11.0,16.0,15175.0
263001,1004472,337,0,4,16.0,1,0.0,1.0,1.0,11.0,15.0,15430.0
263003,1004472,480,0,4,16.0,1,0.0,1.0,1.0,2.0,15.0,15387.0
263011,1004473,159,1,3,1.0,1,3.0,0.0,1.0,8.0,17.0,19253.0

In [39]:
# Find the number of women in the data
c = new_data1['Gender'].value_counts()[0]
c

10175

In [41]:
# Calculating the prcentage of women
n = len(new_data1['Gender'])
n

49390

In [43]:
perc_women = c/n*100
perc_women

20.601336302895323

In [44]:
from statsmodels.stats.proportion import proportions_ztest

In [48]:
p0 = 0.35

In [49]:
z_statistic, p_value = proportions_ztest(count = c, nobs = n, value = p0)
print(z_statistic, p_value)

-79.12020590883206 0.0

### Q3. Is the average purchase made by men and women of the age 18-25 same

In [60]:
new_data_men = data.loc[(data['Age']==1) & (data['Gender']==1)]
new_data_women = data.loc[(data['Age']==1) & data['Gender']==0]

In [63]:
Men_data_sample = new_data_men.sample(500, random_state =8)

In [64]:
from scipy.stats import ttest_ind

In [65]:
p_value, t_statistic = ttest_ind(Men_data_sample['Purchase'], Women_data_sample['Purchase'])
print(p_value)
print(t_statistic)

0.32810123360500915
0.7429039429126174

In [ ]:
# Since p_value < alpha, we reject the null hypothesis ans accept the alternate hypothesis.

In [67]:
Men_data_sample['Purchase'].mean()

11563.324

In [68]:
Women_data_sample['Purchase'].mean()

11458.802

### Q4.  Is the percentage of men who have spent more than 10000 the same for the ages 18-25 and 26-35?

In [105]:
Lower_agegroup_men = data.loc[(data['Age']==1) & (data['Purchase']>10000)]
Upper_agegroup_men = data.loc[(data['Age']==2) & (data['Purchase']>10000)]

In [106]:
Lower_agegroup_men_sample = Lower_agegroup_men.sample(1000, random_state=0)
Upper_agegroup_men_sample = Upper_agegroup_men.sample(1000, random_state=0)

In [107]:
#null hypothesis - Percentage of the men in the age groups is same
#alternate hypothesis - Percentage of the men in the age groups is not same

In [108]:
(Lower_agegroup_men_sample['Gender']==1).sum()

815

In [109]:
(Upper_agegroup_men_sample['Gender']==1).sum()

828

In [110]:
count = [(Lower_agegroup_men_sample['Gender']==1).sum(), (Upper_agegroup_men_sample['Gender']==1).sum()]

In [111]:
count

[815, 828]

In [119]:
nobs = [(len(Lower_agegroup_men_sample)), (len(Upper_agegroup_men_sample))]
nobs

[1000, 1000]

In [120]:
z_statistic, p_value = proportions_ztest(count = count, nobs = nobs, value = 0)

In [121]:
print(z_statistic)
print(p_value)

-0.759111307093946
0.44778597581119517

In [ ]:
# Since p_value > alpha, we accept Null Hypo,

### Solve this by yourself: Is the percentage of women who have spent more than 13500 the same for the ages 18-25 and 36-50?